{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "userDefinedMetadata": {"signature": {"inputs": {"mask_1:0": {"name": "mask_1:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}, "deterministic:0": {"name": "deterministic:0", "dtype": "DT_BOOL", "tensorShape": {}}, "args_0:0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "31"}, {"size": "31"}, {"size": "3"}]}}, "mask:0": {"name": "mask:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/agent/Any_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/agent/Const_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Any/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Const_5", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/Const", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_5/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/ExpandDims_2/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_3/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/agent/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "31"}, {"size": "31"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deterministic", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "mask", "op": "Placeholder", "attr": {"dtype": {"type": "DT_BOOL"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, {"name": "mask_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_BOOL"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, {"name": "StatefulPartitionedCall/agent/Shape_1", "op": "Shape", "input": ["args_0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/agent/Shape", "op": "Shape", "input": ["args_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Any_1", "op": "Any", "input": ["mask", "StatefulPartitionedCall/agent/Any_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/agent/Shape_3", "op": "Shape", "input": ["mask"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/agent/Any", "op": "Any", "input": ["mask_1", "StatefulPartitionedCall/agent/Any/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Shape_2", "op": "Shape", "input": ["mask_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/agent/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/agent/Shape_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/agent/Shape", "StatefulPartitionedCall/agent/strided_slice/stack", "StatefulPartitionedCall/agent/strided_slice/stack_1", "StatefulPartitionedCall/agent/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/agent/All_1", "op": "All", "input": ["StatefulPartitionedCall/agent/Any_1", "StatefulPartitionedCall/agent/Const_6"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Cast_3", "op": "Cast", "input": ["StatefulPartitionedCall/agent/Shape_3"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/All", "op": "All", "input": ["StatefulPartitionedCall/agent/Any", "StatefulPartitionedCall/agent/Const_5"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/Cast_2", "op": "Cast", "input": ["StatefulPartitionedCall/agent/Shape_2"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/agent/strided_slice"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_9/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/agent/All_1", "StatefulPartitionedCall/agent/Const"], "attr": {"T": {"type": "DT_BOOL"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_7/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/agent/All", "StatefulPartitionedCall/agent/Const"], "attr": {"T": {"type": "DT_BOOL"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/agent/ExpandDims_2", "op": "ExpandDims", "input": ["StatefulPartitionedCall/agent/Cast", "StatefulPartitionedCall/agent/ExpandDims_2/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/agent/Cast", "StatefulPartitionedCall/agent/ExpandDims_1/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/agent/Cast", "StatefulPartitionedCall/agent/ExpandDims/dim"], "attr": {"T": {"type": "DT_INT64"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/agent/ExpandDims_2", "StatefulPartitionedCall/agent/Const_3", "StatefulPartitionedCall/agent/concat_2/axis"], "attr": {"T": {"type": "DT_INT64"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/agent/ExpandDims_1", "StatefulPartitionedCall/agent/Const_2", "StatefulPartitionedCall/agent/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/agent/ExpandDims", "StatefulPartitionedCall/agent/Const_1", "StatefulPartitionedCall/agent/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_5/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/agent/Cast_3", "StatefulPartitionedCall/agent/concat_2"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_3/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/agent/Cast_2", "StatefulPartitionedCall/agent/concat_1"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_1/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/agent/Cast_1", "StatefulPartitionedCall/agent/concat"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_5/All", "op": "All", "input": ["StatefulPartitionedCall/agent/assert_equal_5/Equal", "StatefulPartitionedCall/agent/assert_equal_5/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_3/All", "op": "All", "input": ["StatefulPartitionedCall/agent/assert_equal_3/Equal", "StatefulPartitionedCall/agent/assert_equal_3/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_1/All", "op": "All", "input": ["StatefulPartitionedCall/agent/assert_equal_1/Equal", "StatefulPartitionedCall/agent/assert_equal_1/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard", "op": "If", "input": ["StatefulPartitionedCall/agent/assert_equal_1/All", "StatefulPartitionedCall/agent/assert_equal_1/All", "StatefulPartitionedCall/agent/Cast_1", "StatefulPartitionedCall/agent/concat"], "attr": {"_read_only_resource_inputs": {"list": {}}, "else_branch": {"func": {"name": "__inference_agent_assert_equal_1_Assert_AssertGuard_false_1481_397"}}, "Tout": {"list": {"type": ["DT_BOOL"]}}, "_lower_using_switch_merge": {"b": false}, "Tcond": {"type": "DT_BOOL"}, "output_shapes": {"list": {"shape": [{}]}}, "Tin": {"list": {"type": ["DT_BOOL", "DT_INT64", "DT_INT64"]}}, "then_branch": {"func": {"name": "__inference_agent_assert_equal_1_Assert_AssertGuard_true_1480_386"}}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_3/Assert/AssertGuard", "op": "If", "input": ["StatefulPartitionedCall/agent/assert_equal_3/All", "StatefulPartitionedCall/agent/assert_equal_3/All", "StatefulPartitionedCall/agent/Cast_2", "StatefulPartitionedCall/agent/concat_1", "^StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard"], "attr": {"_lower_using_switch_merge": {"b": false}, "Tcond": {"type": "DT_BOOL"}, "then_branch": {"func": {"name": "__inference_agent_assert_equal_3_Assert_AssertGuard_true_1516_299"}}, "Tout": {"list": {"type": ["DT_BOOL"]}}, "output_shapes": {"list": {"shape": [{}]}}, "_read_only_resource_inputs": {"list": {}}, "Tin": {"list": {"type": ["DT_BOOL", "DT_INT64", "DT_INT64"]}}, "else_branch": {"func": {"name": "__inference_agent_assert_equal_3_Assert_AssertGuard_false_1517_197"}}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_5/Assert/AssertGuard", "op": "If", "input": ["StatefulPartitionedCall/agent/assert_equal_5/All", "StatefulPartitionedCall/agent/assert_equal_5/All", "StatefulPartitionedCall/agent/Cast_3", "StatefulPartitionedCall/agent/concat_2", "^StatefulPartitionedCall/agent/assert_equal_3/Assert/AssertGuard"], "attr": {"else_branch": {"func": {"name": "__inference_agent_assert_equal_5_Assert_AssertGuard_false_1551_111"}}, "then_branch": {"func": {"name": "__inference_agent_assert_equal_5_Assert_AssertGuard_true_1550_176"}}, "Tcond": {"type": "DT_BOOL"}, "Tout": {"list": {"type": ["DT_BOOL"]}}, "_lower_using_switch_merge": {"b": false}, "Tin": {"list": {"type": ["DT_BOOL", "DT_INT64", "DT_INT64"]}}, "output_shapes": {"list": {"shape": [{}]}}, "_read_only_resource_inputs": {"list": {}}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_7/Assert/AssertGuard", "op": "If", "input": ["StatefulPartitionedCall/agent/assert_equal_7/Equal", "StatefulPartitionedCall/agent/assert_equal_7/Equal", "StatefulPartitionedCall/agent/All", "StatefulPartitionedCall/agent/Const", "^StatefulPartitionedCall/agent/assert_equal_5/Assert/AssertGuard"], "attr": {"_lower_using_switch_merge": {"b": false}, "then_branch": {"func": {"name": "__inference_agent_assert_equal_7_Assert_AssertGuard_true_1582_583"}}, "else_branch": {"func": {"name": "__inference_agent_assert_equal_7_Assert_AssertGuard_false_1583_169"}}, "Tcond": {"type": "DT_BOOL"}, "Tin": {"list": {"type": ["DT_BOOL", "DT_BOOL", "DT_BOOL"]}}, "_read_only_resource_inputs": {"list": {}}, "Tout": {"list": {"type": ["DT_BOOL"]}}, "output_shapes": {"list": {"shape": [{}]}}}}, {"name": "StatefulPartitionedCall/agent/assert_equal_9/Assert/AssertGuard", "op": "If", "input": ["StatefulPartitionedCall/agent/assert_equal_9/Equal", "StatefulPartitionedCall/agent/assert_equal_9/Equal", "StatefulPartitionedCall/agent/All_1", "StatefulPartitionedCall/agent/Const", "^StatefulPartitionedCall/agent/assert_equal_7/Assert/AssertGuard"], "attr": {"then_branch": {"func": {"name": "__inference_agent_assert_equal_9_Assert_AssertGuard_true_1613_18"}}, "_read_only_resource_inputs": {"list": {}}, "output_shapes": {"list": {"shape": [{}]}}, "Tout": {"list": {"type": ["DT_BOOL"]}}, "_lower_using_switch_merge": {"b": false}, "else_branch": {"func": {"name": "__inference_agent_assert_equal_9_Assert_AssertGuard_false_1614_29"}}, "Tin": {"list": {"type": ["DT_BOOL", "DT_BOOL", "DT_BOOL"]}}, "Tcond": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall/agent/assert_equal_9/Assert/AssertGuard", "^deterministic"]}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_42", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "8"}]}}}}}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_43", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_44", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "968"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_45", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/All", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Maximum", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_46", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_47", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_48", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_49", "op": "Const", "input": ["^Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard", "op": "If", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/All", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/All", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Maximum", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Const"], "attr": {"Tout": {"list": {"type": ["DT_BOOL"]}}, "_lower_using_switch_merge": {"b": false}, "output_shapes": {"list": {"shape": [{}]}}, "Tin": {"list": {"type": ["DT_BOOL", "DT_INT64", "DT_INT64"]}}, "_read_only_resource_inputs": {"list": {}}, "then_branch": {"func": {"name": "__inference_agent_assert_equal_1_Assert_AssertGuard_true_1657_204"}}, "else_branch": {"func": {"name": "__inference_agent_assert_equal_1_Assert_AssertGuard_false_1658_186"}}, "Tcond": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/range/start", "op": "Const", "input": ["^StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/range/delta", "op": "Const", "input": ["^StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Shape", "op": "Shape", "input": ["args_0", "^StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/strided_slice/stack", "op": "Const", "input": ["^StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/strided_slice/stack_1", "op": "Const", "input": ["^StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/strided_slice/stack_2", "op": "Const", "input": ["^StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/Const", "op": "Const", "input": ["^StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/assert_equal_1/Assert/AssertGuard"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Shape", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/strided_slice/stack", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/strided_slice/stack_1", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/strided_slice"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/range", "op": "Range", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/range/start", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Cast", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/range/delta"], "attr": {"Tidx": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/Cast"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "ConstantFolding/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/Cast"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/Cast", "ConstantFolding/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones", "op": "Fill", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/packed", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/stack", "op": "Pack", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/range", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/ones"], "attr": {"axis": {"i": "1"}, "T": {"type": "DT_INT64"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/policy/cond", "op": "If", "input": ["deterministic", "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_42", "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_43", "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_44", "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_45", "args_0", "StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/stack", "deterministic", "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_46", "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_47", "mask_1", "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_48", "Func/StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/input/_49", "mask"], "attr": {"Tcond": {"type": "DT_BOOL"}, "_read_only_resource_inputs": {"list": {"i": ["1", "2", "3", "4", "8", "9", "11", "12"]}}, "else_branch": {"func": {"name": "__inference_policy_cond_false_1700_frozen_907"}}, "then_branch": {"func": {"name": "__inference_policy_cond_true_1699_frozen_908"}}, "Tout": {"list": {"type": ["DT_INT64", "DT_INT64"]}}, "_lower_using_switch_merge": {"b": false}, "Tin": {"list": {"type": ["DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_INT64", "DT_BOOL", "DT_FLOAT", "DT_FLOAT", "DT_BOOL", "DT_FLOAT", "DT_FLOAT", "DT_BOOL"]}}, "output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}]}]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/policy/cond"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/agent/StatefulPartitionedCall/agent/StatefulPartitionedCall/policy/cond:1"], "attr": {"T": {"type": "DT_INT64"}}}], "library": {"function": [{"signature": {"name": "__inference_agent_assert_equal_1_Assert_AssertGuard_true_1480_386", "inputArg": [{"name": "agent_assert_equal_1_assert_assertguard_identity_agent_assert_equal_1_all", "type": "DT_BOOL"}, {"name": "agent_assert_equal_1_assert_assertguard_placeholder", "type": "DT_INT64"}, {"name": "agent_assert_equal_1_assert_assertguard_placeholder_1", "type": "DT_INT64"}], "outputArg": [{"name": "agent_assert_equal_1_assert_assertguard_identity_1", "type": "DT_BOOL"}]}, "ret": {"agent_assert_equal_1_assert_assertguard_identity_1": "agent_assert_equal_1_assert_assertguard_identity_agent_assert_equal_1_all"}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}}}, {"signature": {"name": "__inference_agent_assert_equal_5_Assert_AssertGuard_true_1550_176", "inputArg": [{"name": "agent_assert_equal_5_assert_assertguard_identity_agent_assert_equal_5_all", "type": "DT_BOOL"}, {"name": "agent_assert_equal_5_assert_assertguard_placeholder", "type": "DT_INT64"}, {"name": "agent_assert_equal_5_assert_assertguard_placeholder_1", "type": "DT_INT64"}], "outputArg": [{"name": "agent_assert_equal_5_assert_assertguard_identity_1", "type": "DT_BOOL"}]}, "ret": {"agent_assert_equal_5_assert_assertguard_identity_1": "agent_assert_equal_5_assert_assertguard_identity_agent_assert_equal_5_all"}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "2"}]}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "2"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_agent_assert_equal_1_Assert_AssertGuard_true_1657_204", "inputArg": [{"name": "agent_assert_equal_1_assert_assertguard_identity_agent_assert_equal_1_all", "type": "DT_BOOL"}, {"name": "agent_assert_equal_1_assert_assertguard_placeholder", "type": "DT_INT64"}, {"name": "agent_assert_equal_1_assert_assertguard_placeholder_1", "type": "DT_INT64"}], "outputArg": [{"name": "agent_assert_equal_1_assert_assertguard_identity_1", "type": "DT_BOOL"}]}, "ret": {"agent_assert_equal_1_assert_assertguard_identity_1": "agent_assert_equal_1_assert_assertguard_identity_agent_assert_equal_1_all"}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_policy_cond_true_1699_frozen_908", "inputArg": [{"name": "policy_cond_1721", "type": "DT_FLOAT"}, {"name": "policy_cond_1723", "type": "DT_FLOAT"}, {"name": "policy_cond_1725", "type": "DT_FLOAT"}, {"name": "policy_cond_1727", "type": "DT_FLOAT"}, {"name": "policy_cond_args_0", "type": "DT_FLOAT"}, {"name": "policy_cond_horizons", "type": "DT_INT64"}, {"name": "policy_cond_deterministic", "type": "DT_BOOL"}, {"name": "policy_cond_1733", "type": "DT_FLOAT"}, {"name": "policy_cond_1735", "type": "DT_FLOAT"}, {"name": "policy_cond_mask", "type": "DT_BOOL"}, {"name": "policy_cond_1753", "type": "DT_FLOAT"}, {"name": "policy_cond_1755", "type": "DT_FLOAT"}, {"name": "policy_cond_mask_1", "type": "DT_BOOL"}], "outputArg": [{"name": "policy_cond_identity", "type": "DT_INT64"}, {"name": "policy_cond_identity_1", "type": "DT_INT64"}], "isStateful": true, "controlOutput": ["policy/cond/StatefulPartitionedCall_1", "policy/cond/StatefulPartitionedCall_2", "policy/cond/StatefulPartitionedCall"]}, "nodeDef": [{"name": "__inference_policy_cond_true_1699_frozen_908/policy/cond/PartitionedCall/move_distribution/ArgMax/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_policy_cond_true_1699_frozen_908/policy/cond/PartitionedCall_1/draw_distribution/ArgMax/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/policy/cond/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "input": ["^policy_cond_1721", "^policy_cond_1723", "^policy_cond_1725", "^policy_cond_1727", "^policy_cond_args_0", "^policy_cond_deterministic", "^policy_cond_horizons"]}, {"name": "policy/cond/StatefulPartitionedCall", "op": "NoOp", "input": ["^Func/policy/cond/StatefulPartitionedCall/input_control_node/_0"]}, {"name": "policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall/conv2d0/Conv2D", "op": "Conv2D", "input": ["policy_cond_args_0", "policy_cond_1721", "^Func/policy/cond/StatefulPartitionedCall/input_control_node/_0"], "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall/network/PartitionedCall/flatten0/Reshape/shape", "op": "Const", "input": ["^Func/policy/cond/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall/network/PartitionedCall_1/out/Reshape/shape", "op": "Const", "input": ["^Func/policy/cond/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall/conv2d0/BiasAdd", "op": "BiasAdd", "input": ["policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall/conv2d0/Conv2D:output:0", "policy_cond_1723"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall/conv2d0/PartitionedCall/activation/Elu", "op": "Elu", "input": ["policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall/conv2d0/BiasAdd:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/StatefulPartitionedCall/network/PartitionedCall/flatten0/Reshape", "op": "Reshape", "input": ["policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall/conv2d0/PartitionedCall/activation/Elu:activations:0", "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall/network/PartitionedCall/flatten0/Reshape/shape:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall_1/dense0/MatMul", "op": "MatMul", "input": ["policy/cond/StatefulPartitionedCall/network/PartitionedCall/flatten0/Reshape:output:0", "policy_cond_1725"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall_1/dense0/BiasAdd", "op": "BiasAdd", "input": ["policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall_1/dense0/MatMul:product:0", "policy_cond_1727"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall_1/dense0/PartitionedCall/activation/Tanh", "op": "Tanh", "input": ["policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall_1/dense0/BiasAdd:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/StatefulPartitionedCall/network/PartitionedCall_1/out/Reshape", "op": "Reshape", "input": ["policy/cond/StatefulPartitionedCall/network/StatefulPartitionedCall_1/dense0/PartitionedCall/activation/Tanh:y:0", "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall/network/PartitionedCall_1/out/Reshape/shape:output:0"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/policy/cond/StatefulPartitionedCall_1/input_control_node/_10", "op": "NoOp", "input": ["^policy/cond/StatefulPartitionedCall/network/PartitionedCall_1/out/Reshape", "^policy_cond_1733", "^policy_cond_1735", "^policy_cond_mask"]}, {"name": "Func/policy/cond/StatefulPartitionedCall_2/input_control_node/_25", "op": "NoOp", "input": ["^policy/cond/StatefulPartitionedCall/network/PartitionedCall_1/out/Reshape", "^policy_cond_1753", "^policy_cond_1755", "^policy_cond_mask_1"]}, {"name": "policy/cond/StatefulPartitionedCall_1", "op": "NoOp", "input": ["^Func/policy/cond/StatefulPartitionedCall_1/input_control_node/_10"]}, {"name": "policy/cond/StatefulPartitionedCall_1/move_distribution/StatefulPartitionedCall/action_values/StatefulPartitionedCall/linear/MatMul", "op": "MatMul", "input": ["policy/cond/StatefulPartitionedCall/network/PartitionedCall_1/out/Reshape:output:0", "policy_cond_1733", "^Func/policy/cond/StatefulPartitionedCall_1/input_control_node/_10"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall_1/move_distribution/Reshape/shape", "op": "Const", "input": ["^Func/policy/cond/StatefulPartitionedCall_1/input_control_node/_10"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall_1/move_distribution/Fill/value", "op": "Const", "input": ["^Func/policy/cond/StatefulPartitionedCall_1/input_control_node/_10"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "policy/cond/StatefulPartitionedCall_2", "op": "NoOp", "input": ["^Func/policy/cond/StatefulPartitionedCall_2/input_control_node/_25"]}, {"name": "policy/cond/StatefulPartitionedCall_2/draw_distribution/StatefulPartitionedCall/action_values/StatefulPartitionedCall/linear/MatMul", "op": "MatMul", "input": ["policy/cond/StatefulPartitionedCall/network/PartitionedCall_1/out/Reshape:output:0", "policy_cond_1753", "^Func/policy/cond/StatefulPartitionedCall_2/input_control_node/_25"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall_2/draw_distribution/Reshape/shape", "op": "Const", "input": ["^Func/policy/cond/StatefulPartitionedCall_2/input_control_node/_25"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall_2/draw_distribution/Fill/value", "op": "Const", "input": ["^Func/policy/cond/StatefulPartitionedCall_2/input_control_node/_25"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/StatefulPartitionedCall_1/move_distribution/StatefulPartitionedCall/action_values/StatefulPartitionedCall/linear/BiasAdd", "op": "BiasAdd", "input": ["policy/cond/StatefulPartitionedCall_1/move_distribution/StatefulPartitionedCall/action_values/StatefulPartitionedCall/linear/MatMul:product:0", "policy_cond_1735"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/StatefulPartitionedCall_2/draw_distribution/StatefulPartitionedCall/action_values/StatefulPartitionedCall/linear/BiasAdd", "op": "BiasAdd", "input": ["policy/cond/StatefulPartitionedCall_2/draw_distribution/StatefulPartitionedCall/action_values/StatefulPartitionedCall/linear/MatMul:product:0", "policy_cond_1755"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "policy/cond/StatefulPartitionedCall_1/move_distribution/Reshape", "op": "Reshape", "input": ["policy/cond/StatefulPartitionedCall_1/move_distribution/StatefulPartitionedCall/action_values/StatefulPartitionedCall/linear/BiasAdd:output:0", "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall_1/move_distribution/Reshape/shape:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "policy/cond/StatefulPartitionedCall_2/draw_distribution/Reshape", "op": "Reshape", "input": ["policy/cond/StatefulPartitionedCall_2/draw_distribution/StatefulPartitionedCall/action_values/StatefulPartitionedCall/linear/BiasAdd:output:0", "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall_2/draw_distribution/Reshape/shape:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "policy/cond/StatefulPartitionedCall_1/move_distribution/Shape", "op": "Shape", "input": ["policy/cond/StatefulPartitionedCall_1/move_distribution/Reshape:output:0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/StatefulPartitionedCall_2/draw_distribution/Shape", "op": "Shape", "input": ["policy/cond/StatefulPartitionedCall_2/draw_distribution/Reshape:output:0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/StatefulPartitionedCall_1/move_distribution/Fill", "op": "Fill", "input": ["policy/cond/StatefulPartitionedCall_1/move_distribution/Shape:output:0", "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall_1/move_distribution/Fill/value:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "policy/cond/StatefulPartitionedCall_2/draw_distribution/Fill", "op": "Fill", "input": ["policy/cond/StatefulPartitionedCall_2/draw_distribution/Shape:output:0", "__inference_policy_cond_true_1699_frozen_908/policy/cond/StatefulPartitionedCall_2/draw_distribution/Fill/value:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "policy/cond/StatefulPartitionedCall_1/move_distribution/SelectV2", "op": "SelectV2", "input": ["policy_cond_mask", "policy/cond/StatefulPartitionedCall_1/move_distribution/Reshape:output:0", "policy/cond/StatefulPartitionedCall_1/move_distribution/Fill:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/StatefulPartitionedCall_2/draw_distribution/SelectV2", "op": "SelectV2", "input": ["policy_cond_mask_1", "policy/cond/StatefulPartitionedCall_2/draw_distribution/Reshape:output:0", "policy/cond/StatefulPartitionedCall_2/draw_distribution/Fill:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/PartitionedCall/move_distribution/ArgMax", "op": "ArgMax", "input": ["policy/cond/StatefulPartitionedCall_1/move_distribution/SelectV2:output:0", "__inference_policy_cond_true_1699_frozen_908/policy/cond/PartitionedCall/move_distribution/ArgMax/dimension:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "policy/cond/PartitionedCall_1/draw_distribution/ArgMax", "op": "ArgMax", "input": ["policy/cond/StatefulPartitionedCall_2/draw_distribution/SelectV2:output:0", "__inference_policy_cond_true_1699_frozen_908/policy/cond/PartitionedCall_1/draw_distribution/ArgMax/dimension:output:0"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "policy/cond/Identity_1", "op": "Identity", "input": ["policy/cond/PartitionedCall/move_distribution/ArgMax:output:0", "^Func/policy/cond/StatefulPartitionedCall_2/input_control_node/_25"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "policy/cond/Identity", "op": "Identity", "input": ["policy/cond/PartitionedCall_1/draw_distribution/ArgMax:output:0", "^Func/policy/cond/StatefulPartitionedCall_1/input_control_node/_10"], "attr": {"T": {"type": "DT_INT64"}}}], "ret": {"policy_cond_identity_1": "policy/cond/Identity_1:output:0", "policy_cond_identity": "policy/cond/Identity:output:0"}, "controlRet": {"policy/cond/StatefulPartitionedCall_2": "policy/cond/StatefulPartitionedCall_2", "policy/cond/StatefulPartitionedCall_1": "policy/cond/StatefulPartitionedCall_1", "policy/cond/StatefulPartitionedCall": "policy/cond/StatefulPartitionedCall"}, "argAttr": {"6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "12": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "2"}]}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "4"}]}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "2"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "31"}, {"size": "31"}, {"size": "3"}]}]}}}}}}, {"signature": {"name": "__inference_agent_assert_equal_9_Assert_AssertGuard_true_1613_18", "inputArg": [{"name": "agent_assert_equal_9_assert_assertguard_identity_agent_assert_equal_9_all", "type": "DT_BOOL"}, {"name": "agent_assert_equal_9_assert_assertguard_placeholder", "type": "DT_BOOL"}, {"name": "agent_assert_equal_9_assert_assertguard_placeholder_1", "type": "DT_BOOL"}], "outputArg": [{"name": "agent_assert_equal_9_assert_assertguard_identity_1", "type": "DT_BOOL"}]}, "ret": {"agent_assert_equal_9_assert_assertguard_identity_1": "agent_assert_equal_9_assert_assertguard_identity_agent_assert_equal_9_all"}, "argAttr": {"2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_move_distribution_cond_true_927_91", "inputArg": [{"name": "move_distribution_cond_argmax_action_values", "type": "DT_FLOAT"}, {"name": "move_distribution_cond_placeholder", "type": "DT_FLOAT"}, {"name": "move_distribution_cond_placeholder_1", "type": "DT_FLOAT"}, {"name": "move_distribution_cond_placeholder_2", "type": "DT_FLOAT"}, {"name": "move_distribution_cond_placeholder_3", "type": "DT_FLOAT"}], "outputArg": [{"name": "move_distribution_cond_identity", "type": "DT_INT64"}]}, "nodeDef": [{"name": "__inference_move_distribution_cond_true_927_91/move_distribution/cond/ArgMax/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "move_distribution/cond/ArgMax", "op": "ArgMax", "input": ["move_distribution_cond_argmax_action_values", "__inference_move_distribution_cond_true_927_91/move_distribution/cond/ArgMax/dimension:output:0"], "attr": {"Tidx": {"type": "DT_INT32"}, "output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}], "ret": {"move_distribution_cond_identity": "move_distribution/cond/ArgMax:output:0"}, "argAttr": {"3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "4"}]}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "4"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "4"}]}]}}}}}}, {"signature": {"name": "__inference_agent_assert_equal_3_Assert_AssertGuard_true_1516_299", "inputArg": [{"name": "agent_assert_equal_3_assert_assertguard_identity_agent_assert_equal_3_all", "type": "DT_BOOL"}, {"name": "agent_assert_equal_3_assert_assertguard_placeholder", "type": "DT_INT64"}, {"name": "agent_assert_equal_3_assert_assertguard_placeholder_1", "type": "DT_INT64"}], "outputArg": [{"name": "agent_assert_equal_3_assert_assertguard_identity_1", "type": "DT_BOOL"}]}, "ret": {"agent_assert_equal_3_assert_assertguard_identity_1": "agent_assert_equal_3_assert_assertguard_identity_agent_assert_equal_3_all"}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "2"}]}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "2"}]}]}}}}}}, {"signature": {"name": "__inference_policy_cond_false_1700_frozen_907", "inputArg": [{"name": "policy_cond_1815", "type": "DT_FLOAT"}, {"name": "policy_cond_1817", "type": "DT_FLOAT"}, {"name": "policy_cond_1819", "type": "DT_FLOAT"}, {"name": "policy_cond_1821", "type": "DT_FLOAT"}, {"name": "policy_cond_args_0", "type": "DT_FLOAT"}, {"name": "policy_cond_horizons", "type": "DT_INT64"}, {"name": "policy_cond_placeholder", "type": "DT_BOOL"}, {"name": "policy_cond_1823", "type": "DT_FLOAT"}, {"name": "policy_cond_1825", "type": "DT_FLOAT"}, {"name": "policy_cond_mask", "type": "DT_BOOL"}, {"name": "policy_cond_1827", "type": "DT_FLOAT"}, {"name": "policy_cond_1829", "type": "DT_FLOAT"}, {"name": "policy_cond_mask_1", "type": "DT_BOOL"}], "outputArg": [{"name": "policy_cond_identity", "type": "DT_INT64"}, {"name": "policy_cond_identity_1", "type": "DT_INT64"}], "isStateful": true, "controlOutput": ["policy/cond/StatefulPartitionedCall"]}, "nodeDef": [{"name": "Func/policy/cond/StatefulPartitionedCall/input_control_node/_2", "op": "NoOp", "input": ["^policy_cond_1815", "^policy_cond_1817", "^policy_cond_1819", "^policy_cond_1821", "^policy_cond_1823", "^policy_cond_1825", "^policy_cond_1827", "^policy_cond_1829", "^policy_cond_args_0", "^policy_cond_horizons", "^policy_cond_mask", "^policy_cond_mask_1"]}, {"name": "__inference_policy_cond_false_1700_frozen_907/policy/cond/StatefulPartitionedCall/policy/StatefulPartitionedCall_3/draw_distribution/ReduceLogSumExp/Max/reduction_indices", "op": "Const", "input": ["^Func/policy/cond/StatefulPartitionedCall/input_control_node/_2"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": 